[
  {
    "title": "Building Up",
    "subtitle": "A GraphQL Based online fundraising platform",
    "description": "As a Technical Lead for UW Blueprint, I drove the development of an online fundraising platform to help not-for-profits raise through community outreach. Users would be able to sign up, recruit members of their school community, raise money and compete against other schools in the country.",
    "githuburl": "https://github.com/uwblueprint/building-up-server",
    "devposturl":"devpost.com"
  },
  {
    "title": "Choose Your Adventure",
    "subtitle": "Build and Share your own choose-your-own-adventure stories",
    "description": "Developed a web-application to allow authors to develop and share stories using a graph-based UI with an integrated markdown editor. Submitted to Hack the North 2021.",
    "githuburl": "https://github.com/faizaanmadhani/choose-your-adventure",
    "devposturl":"devpost.com"
  },
  {
    "title": "Business Education Partnership",
    "subtitle": "An online platform to help high school students determine their post-secondary career pathways",
    "description": "As part of my work at UW Blueprint, I developed a matching platform to help high school students meet local employers and industry professionals for job and volunteer oppurtunities, to help them easily learn about their post-secondary pathways.",
    "githuburl": "https://github.com/uwblueprint/BEP",
    "devposturl":"devpost.com"
  },
  {
    "title": "Assemble",
    "subtitle": "Generate Math Contests, powered by Elasticsearch",
    "description": "In an effort to explore GraphQL and web scraping, I built an API that triaged and indexed over 1000 AMC Math Contest Questions and generated practice contests for students based on filters. Built using JavaScript and GraphQL, with a backend powered by Elasticsearch.",
    "githuburl":"https://github.com/faizaanmadhani/assemble",
    "devposturl":""
  },
  {
    "title": "Social Development Center",
    "subtitle": "Digital Flowcharts to provide access to social-services information",
    "description": "As part of my work at UW Blueprint, I helped develop an online platform to allow users to retrieve information regarding legal, housing and financial help in their community.",
    "githuburl": "https://github.com/uwblueprint/sdc-web",
    "devposturl":"devpost.com"
  },
  {
    "title": "Bittorent Client",
    "subtitle": "A CLI Bittorent Client, built in Go",
    "description": "To learn more about networking, concurrency, encoding and Go, I built a bittorent client.",
    "githuburl":"https://github.com/faizaanmadhani/bittorent_client",
    "devposturl":""
  },
  {
    "title": "Insuremotion",
    "subtitle": "Hack the 6ix 2019",
    "description": "A mobile app that tracks your driving to determine whether or not you have a road rage problem. Built using OpenCV, React Native (Expo) and Flask. I was responsible for the OpenCV backend.",
    "githuburl":"https://github.com/faizaanmadhani/InsureMotion",
    "devposturl":"https://devpost.com/software/insuremotion"
  },
  {
    "title": "MoleculAR",
    "subtitle": "The visual search engine for molecules in AR. Presented at Hack the North 2019",
    "description": "MoleculAR is an AR application that takes in the common names of almost all possible chemicals, computationally generates a 3D structure of that molecule and proceeds to render that in an AR space. I built the AR Frontend using ViroReact and acted in a PM Role.",
    "githuburl":"https://devpost.com/software/molecular",
    "devposturl":""
  },
  {
    "title": "BlindChess",
    "subtitle": "Chess for the blind, or for anyone looking to improve their memory. Presented at PCHacks 2019.",
    "description": "Uses a Google Home, Dialougeflow and Stockfish to allow a user to connect to play a game of chess by talking. Written in Python (Flask).",
    "githuburl":"https://github.com/faizaanmadhani/ChessMania",
    "devposturl":""
  }
]